<?php

namespace LazyBench\Tax\Claim\Constants;

/**
 * Author:LazyBench
 * Date:2019/1/3
 */
class Document
{

    //证件代码
    public const CODE = [
        '101' => '组织机构代码证',
        '199' => '其他单位证件',
        '201' => '居民身份证',
        '202' => '军官证',
        '203' => '武警警官证',
        '204' => '士兵证',
        '205' => '军队离退休干部证',
        '206' => '残疾人证',
        '207' => '残疾军人证（1-8级）',
        '208' => '外国护照',
        '210' => '港澳居民来往内地通行证',
        '212' => '中华人民共和国往来港澳通行证',
        '213' => '台湾居民来往大陆通行证',
        '214' => '大陆居民往来台湾通行证',
        '215' => '外国人居留证',
        '216' => '外交官证',
        '217' => '领事馆证',
        '218' => '海员证',
        '219' => '香港身份证',
        '220' => '台湾身份证',
        '221' => '澳门身份证',
        '222' => '外国人身份证件',
        '224' => '就业失业登记证',
        '225' => '退休证',
        '226' => '离休证',
        '227' => '中国护照',
        '228' => '城镇退役士兵自谋职业证',
        '233' => '外国人永久居留证',
        '234' => '就业创业证',
        '299' => '其他个人证件',

    ];
}
