<?php

namespace LazyBench\Tax\Claim\Constants;

/**
 * Author:LazyBench
 * Date:2019/1/3
 */
class Project
{

    //征收先项目代码
    public const CODE = [
        '10101' => '增值税',
        '10102' => '消费税',
        '10103' => '营业税',
        '10104' => '企业所得税',
        '10105' => '企业所得税退税',
        '10106' => '个人所得税',
        '10107' => '资源税',
        '10109' => '城市维护建设税',
        '10110' => '房产税',
        '10111' => '印花税',
        '10112' => '城镇土地使用税',
        '10113' => '土地增值税',
        '10114' => '车船税',
        '10115' => '船舶吨税',
        '10116' => '车辆购置税',
        '10117' => '关税',
        '10118' => '耕地占用税',
        '10119' => '契税',
        '10120' => '烟叶税',
        '10125' => '屠宰税（废止）',
        '10199' => '其他税收收入',
        '10201' => '企业职工基本养老保险基金收入',
        '10202' => '失业保险基金收入',
        '10203' => '基本医疗保险基金收入',
        '10204' => '工伤保险基金收入',
        '10205' => '生育保险基金收入',
        '10206' => '新型农村合作医疗基金收入',
        '10207' => '城镇居民基本医疗保险基金收入',
        '10210' => '城乡居民基本养老保险基金收入',
        '10211' => '机关事业单位基本养老保险基金收入',
        '10291' => '机关事业单位职业年金',
        '10299' => '其他社会保险基金收入',
        '30142' => '残疾人就业保障金',
        '30144' => '城市公用事业附加收入',
        '30150' => '大中型水库库区基金',
        '30158' => '国家重大水利工程建设基金收入',
        '30175' => '废弃电器电子产品处理基金收入',
        '30176' => '水土保持补偿费收入',
        '30199' => '其他政府性基金收入',
        '30201' => '排污费收入',
        '30202' => '水资源费收入',
        '30203' => '教育费附加',
        '30216' => '地方教育附加',
        '30217' => '文化事业建设费',
        '30218' => '残疾人就业保障金',
        '30221' => '水利建设专项收入',
        '30299' => '其他专项收入',
        '30407' => '财政行政事业性收费收入',
        '30408' => '税务行政事业性收费收入',
        '30432' => '国土资源行政事业性收费收入',
        '30446' => '水利行政事业性收费收入',
        '30499' => '其他行政事业性收费收入',
        '30501' => '税务部门罚没收入',
        '30701' => '海上石油矿区使用费',
        '30702' => '陆上石油矿区使用费',
        '30703' => '场地使用费收入',
        '30705' => '利息收入',
        '30799' => '其他国有资源（产）有偿使用收入',
        '39900' => '其他收入',
    ];
}
